Rafa350/EOS/v2/Include/HTL/STM32/htlGPIO.h
/// \file      halGPIO_ex.h
/// \author    Rafael Serrano (rsr.openware@gmail.com)
/// \brief     GPIO module manager.
/// \addtogroup HAL Hardware Abstraction Layer
/// @{
/// \addtogroup HAL_STM32 STM32 Hardware Abstraction Layer
/// @{
/// \defgroup HAL_STM32_GPIO_ex GPIO++
/// @{

#ifndef __STM32_htlGPIO__
#define __STM32_htlGPIO__


// EOS includes
//
#include "eos.h"
#include "HAL/STM32/halGPIO.h"


#ifdef GPIOA_BASE
#define HTL_GPIO_PORT_A      htl::GPIOPort::portA
#endif
#ifdef GPIOB_BASE
#define HTL_GPIO_PORT_B      htl::GPIOPort::portB
#endif
#ifdef GPIOC_BASE
#define HTH_GPIO_PORT_C      htl::GPIOPort::portC
#endif
#ifdef GPIOD_BASE
#define HTL_GPIO_PORT_D      htl::GPIOPort::portD
#endif
#ifdef GPIOF_BASE
#define HTL_GPIO_PORT_E      htl::GPIOPort::portE
#endif
#ifdef GPIOF_BASE
#define HTL_GPIO_PORT_F      htl::GPIOPort::portF
#endif
#ifdef GPIOG_BASE
#define HTL_GPIO_PORT_G      htl::GPIOPort::portG
#endif
#ifdef GPIOH_BASE
#define HTL_GPIO_PORT_H      htl::GPIOPort::portH
#endif
#ifdef GPIOI_BASE
#define HTL_GPIO_PORT_I      htl::GPIOPort::portI
#endif
#ifdef GPIOJ_BASE
#define HTL_GPIO_PORT_J      htl::GPIOPort::portJ
#endif
#ifdef GPIOK_BASE
#define HTLGPIO_PORT_K       htl::GPIOPort::portK
#endif


#define HTL_GPIO_PIN_0       htl::GPIOPin::pin0
#define HTL_GPIO_PIN_1       htl::GPIOPin::pin1
#define HTL_GPIO_PIN_2       htl::GPIOPin::pin2
#define HTL_GPIO_PIN_3       htl::GPIOPin::pin3
#define HTL_GPIO_PIN_4       htl::GPIOPin::pin4
#define HTL_GPIO_PIN_5       htl::GPIOPin::pin5
#define HTL_GPIO_PIN_6       htl::GPIOPin::pin6
#define HTL_GPIO_PIN_7       htl::GPIOPin::pin7
#define HTL_GPIO_PIN_8       htl::GPIOPin::pin8
#define HTL_GPIO_PIN_9       htl::GPIOPin::pin9
#define HTL_GPIO_PIN_10      htl::GPIOPin::pin10
#define HTL_GPIO_PIN_11      htl::GPIOPin::pin11
#define HTL_GPIO_PIN_12      htl::GPIOPin::pin12
#define HTL_GPIO_PIN_13      htl::GPIOPin::pin13
#define HTL_GPIO_PIN_14      htl::GPIOPin::pin14
#define HTL_GPIO_PIN_15      htl::GPIOPin::pin15


namespace htl {

	/// \brief GPIO port identifiers.
	enum class GPIOPort {
		portA,                    ///< Identificador del port A
		portB,                    ///< Identificador del port B
		portC,          		  ///< Identificador del port C
		portD,		              ///< Identificador del port D
		portE,		              ///< Identificador del port E
		portF,			          ///< Identificador del port F
		portG,		              ///< Identificador del port G
		portH,		              ///< Identificador del port H
		portI,		              ///< Identificador del port I
		portJ,			          ///< Identificador del port J
		portK,			          ///< Identificador del port K
		portNone
	};

	/// \brief GPIO Pin identifiers.
	enum class GPIOPin {
		pin0,				      ///< Identificador del pin 0
		pin1,				      ///< Identificador del pin 1
		pin2,				      ///< Identificador del pin 2
		pin3,				      ///< Identificador del pin 3
		pin4,				      ///< Identificador del pin 4
		pin5,				      ///< Identificador del pin 5
		pin6,				      ///< Identificador del pin 6
		pin7,				      ///< Identificador del pin 7
		pin8,				      ///< Identificador del pin 8
		pin9,			          ///< Identificador del pin 9
		pin10,			          ///< Identificador del pin 10
		pin11,			          ///< Identificador del pin 11
		pin12,			          ///< Identificador del pin 12
		pin13,			          ///< Identificador del pin 13
		pin14,			          ///< Identificador del pin 14
		pin15,				      ///< Identificador del pin 15
		pinNone
	};

	/// \brief GPIO Pull up/down mode identifier.
	enum class GPIOPull {
		none = 0,
		up   = 1,
		down = 2
	};

	/// \brief GPIO Driver type identifiers.
	enum class GPIODriver {
		pushPull  = 0,
		openDrain = 1
	};

	/// \brief GPIO Speed identifier.
	enum class GPIOSpeed {
		low    = 0,
		medium = 1,
		high   = 2,
		fast   = 3
	};

	template <GPIOPort port_, GPIOPin pin_>
	struct GPIOInfo {
		enum class GPIOAlt {
		};
		static const uint32_t addr;
		static const uint32_t pn;
		static const uint32_t rccen;
	};

	/// \class GPIO
	/// \brief Adapter class form pins
	///
	template <GPIOPort port_, GPIOPin pin_>
	class GPIO {
		public:
			using GPIOAlt = typename GPIOInfo<port_, pin_>::GPIOAlt;

		private:
			using Info = GPIOInfo<port_, pin_>;
			constexpr static const uint32_t _addr = Info::addr;
			constexpr static const uint32_t _pn = Info::pn;
			constexpr static const uint32_t _rccen = Info::rccen;

		public:
            constexpr static const GPIOPort port = port_;
			constexpr static const GPIOPin pin = pin_;
            constexpr static const uint32_t hwPort = Info::addr;
            constexpr static const uint32_t hwPin = Info::pn;

		private:
			GPIO() = delete;
			GPIO(const GPIO &) = delete;
			GPIO(const GPIO &&) = delete;
			GPIO & operator = (const GPIO &) = delete;
			GPIO & operator = (const GPIO &&) = delete;

			inline static void enableClock() {
				RCC->AHB1ENR |= _rccen;
			}

			inline static void disableClock() {
				RCC->AHB1ENR &= ~_rccen;
			}

			static void setSpeed(GPIOSpeed speed) {

				GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);

				// Configura el registre OSPEEDR (Output Speed Register)
				//
				uint32_t temp = regs->OSPEEDR;
				temp &= ~(0b11 << (_pn * 2));
				temp |= (uint32_t(speed) & 0b11) << (_pn * 2);
				regs->OSPEEDR = temp;
			}

			static void setPull(GPIOPull pull) {

				GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);

				// Configura el registre PUPDR (Pull Up/Down Register)
				//
				uint32_t temp = regs->PUPDR;
				temp &= ~(0b11 << (_pn * 2));
				temp |= (uint32_t(pull) & 0x11) << (_pn * 2);
				regs->PUPDR = temp;
			}

		public:
			static void initInput(GPIOPull pull = GPIOPull::none) {

				uint32_t temp;
				GPIO_TypeDef *regs = reinterpret_cast<GPIO_TypeDef*>(_addr);

				enableClock();

				// Configura el registre MODER (Mode Register)
				//
				temp = regs->MODER;
				temp &= ~(0b11 << (_pn * 2));
				regs->MODER = temp;

				setPull(pull);
			}

